
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository_ruleset.pr_ruleset_all["atc-router"] has been deleted
  - resource "github_repository_ruleset" "pr_ruleset_all" {
      - enforcement = "active" -> null
      - etag        = "W/\"c174bde79e2692a8203901feb3fc9130d094054f6d741e4faa5e9146ef9c06a9\"" -> null
      - id          = "1422168" -> null
      - name        = "protect-main-branch-atc-router-pre-commit" -> null
      - node_id     = "RRS_lACqUmVwb3NpdG9yec4yMtWLzgAVs1g" -> null
      - repository  = "atc-router" -> null
      - ruleset_id  = 1422168 -> null
      - target      = "branch" -> null

      - bypass_actors {
          - actor_id    = 952934 -> null
          - actor_type  = "Integration" -> null
          - bypass_mode = "always" -> null
        }

      - conditions {
          - ref_name {
              - exclude = [] -> null
              - include = [
                  - "refs/heads/main",
                ] -> null
            }
        }

      - rules {
          - creation                      = false -> null
          - deletion                      = false -> null
          - non_fast_forward              = false -> null
          - required_linear_history       = false -> null
          - required_signatures           = false -> null
          - update                        = false -> null
          - update_allows_fetch_and_merge = false -> null

          - required_status_checks {
              - strict_required_status_checks_policy = true -> null

              - required_check {
                  - context        = "pre-commit" -> null
                  - integration_id = 0 -> null
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"7360a7911edf2ce70f6aed1a6011e99463f53a388d72c270bdcd517bc7e7003c\"" -> "W/\"415acb6519ab214c22ec1a1f46123e3be31dac8b7abc5ae39e97fe9ac3b11ba8\""
        id          = "1393928"
        name        = "protect-main-branch-kong-build-images-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] has been deleted
  - resource "github_repository_ruleset" "pr_ruleset_all" {
      - enforcement = "active" -> null
      - etag        = "W/\"eaed39b8f4135643c47eaf94be6fd24961c4bbb2b74845ab225c03089f4faf8c\"" -> null
      - id          = "1393929" -> null
      - name        = "protect-main-branch-kong-development-pre-commit" -> null
      - node_id     = "RRS_lACqUmVwb3NpdG9yec4x0p-azgAVRQk" -> null
      - repository  = "kong-development" -> null
      - ruleset_id  = 1393929 -> null
      - target      = "branch" -> null

      - bypass_actors {
          - actor_id    = 952934 -> null
          - actor_type  = "Integration" -> null
          - bypass_mode = "always" -> null
        }

      - conditions {
          - ref_name {
              - exclude = [] -> null
              - include = [
                  - "refs/heads/main",
                ] -> null
            }
        }

      - rules {
          - creation                      = false -> null
          - deletion                      = false -> null
          - non_fast_forward              = false -> null
          - required_linear_history       = false -> null
          - required_signatures           = false -> null
          - update                        = false -> null
          - update_allows_fetch_and_merge = false -> null

          - required_status_checks {
              - strict_required_status_checks_policy = true -> null

              - required_check {
                  - context        = "pre-commit" -> null
                  - integration_id = 0 -> null
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"52fbb8b3f0659097afe8c4d6725a8457d3bbd35cd780f70f25db7419e3053f8b\"" -> "W/\"7fce2590b66aaaf954906b569eea3c3432a3a3147108ccc152ebd6c57d03a1f3\""
        id          = "1393927"
        name        = "protect-main-branch-kong-openssl-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] has been deleted
  - resource "github_repository_ruleset" "pr_ruleset_all" {
      - enforcement = "active" -> null
      - etag        = "W/\"3bf9879923ea06ee16a898bad473b721e6eaec2bdeca2c29007bc5303402ef5c\"" -> null
      - id          = "1393870" -> null
      - name        = "protect-main-branch-kong-package-pre-commit" -> null
      - node_id     = "RRS_lACqUmVwb3NpdG9yec4yKpjbzgAVRM4" -> null
      - repository  = "kong-package" -> null
      - ruleset_id  = 1393870 -> null
      - target      = "branch" -> null

      - bypass_actors {
          - actor_id    = 952934 -> null
          - actor_type  = "Integration" -> null
          - bypass_mode = "always" -> null
        }

      - conditions {
          - ref_name {
              - exclude = [] -> null
              - include = [
                  - "refs/heads/main",
                ] -> null
            }
        }

      - rules {
          - creation                      = false -> null
          - deletion                      = false -> null
          - non_fast_forward              = false -> null
          - required_linear_history       = false -> null
          - required_signatures           = false -> null
          - update                        = false -> null
          - update_allows_fetch_and_merge = false -> null

          - required_status_checks {
              - strict_required_status_checks_policy = true -> null

              - required_check {
                  - context        = "pre-commit" -> null
                  - integration_id = 0 -> null
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"ba676f9a3f3d486c744ed11293dcb6993c76bbbaaf521af4de12f1b31daff6b4\"" -> "W/\"19f498b27f7e719de75fc9c63a2dec7d6ad1b13945fb5ac03ac89ca1f4024641\""
        id          = "1393918"
        name        = "protect-main-branch-kong-runtime-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] has been deleted
  - resource "github_repository_ruleset" "pr_ruleset_all" {
      - enforcement = "active" -> null
      - etag        = "W/\"9eebb6fc9ed998bc011a7c3307b3cf6592933d843e6b60bf17d16d43a59875fe\"" -> null
      - id          = "1391897" -> null
      - name        = "protect-main-branch-multi-arch-fpm-pre-commit" -> null
      - node_id     = "RRS_lACqUmVwb3NpdG9yec4yKjYTzgAVPRk" -> null
      - repository  = "multi-arch-fpm" -> null
      - ruleset_id  = 1391897 -> null
      - target      = "branch" -> null

      - bypass_actors {
          - actor_id    = 952934 -> null
          - actor_type  = "Integration" -> null
          - bypass_mode = "always" -> null
        }

      - conditions {
          - ref_name {
              - exclude = [] -> null
              - include = [
                  - "refs/heads/main",
                ] -> null
            }
        }

      - rules {
          - creation                      = false -> null
          - deletion                      = false -> null
          - non_fast_forward              = false -> null
          - required_linear_history       = false -> null
          - required_signatures           = false -> null
          - update                        = false -> null
          - update_allows_fetch_and_merge = false -> null

          - required_status_checks {
              - strict_required_status_checks_policy = true -> null

              - required_check {
                  - context        = "pre-commit" -> null
                  - integration_id = 0 -> null
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"c3c09522d1ba360f99450c79e12d824650b9555b2669049095e4ff13a07c8700\"" -> "W/\"b4f16e98e2fc8e34723ca2e3a1da9f442a22ad8f3d42d42aac81b23fd0bbd717\""
        id          = "1393934"
        name        = "protect-main-branch-template-1-github-release-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"5f83361b54b3eea0e11325cce897a7f81cbedc392154d47512ca379fa9da2c68\"" -> "W/\"38b3898eb16a32bffbff2aeccc068e08630dcd5b84a6fdbcebbe94067fed1bce\""
        id          = "1393937"
        name        = "protect-main-branch-template-1-terraform-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"730e7800dd9607de1395c7f33647ed91e43a0fb7cde1ef0c05f195b28a2f8d5b\"" -> "W/\"aea24f2c8879f4623bdff6d4aef0dd57665604e5c8ed3ddaf3d006a0b8b6ddcd\""
        id          = "1393936"
        name        = "protect-main-branch-template-template-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"c0dd737a8d48f955ca733a540dd330853a8ffde632a5c930b2fdedae74534656\"" -> "W/\"5ce3edefd16e897af16c9fde43294a8a3e675bfa23b3b60627c6ba465b73b7f5\""
        id          = "1393924"
        name        = "protect-main-branch-kong-build-images-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] has been deleted
  - resource "github_repository_ruleset" "pr_ruleset_kong" {
      - enforcement = "active" -> null
      - etag        = "W/\"a98db851fc9b26906dbd1491978bb137b8cad6e5dad4379fc609dfa6a22c6f98\"" -> null
      - id          = "1393926" -> null
      - name        = "protect-main-branch-kong-development-release" -> null
      - node_id     = "RRS_lACqUmVwb3NpdG9yec4x0p-azgAVRQY" -> null
      - repository  = "kong-development" -> null
      - ruleset_id  = 1393926 -> null
      - target      = "branch" -> null

      - bypass_actors {
          - actor_id    = 952934 -> null
          - actor_type  = "Integration" -> null
          - bypass_mode = "always" -> null
        }

      - conditions {
          - ref_name {
              - exclude = [] -> null
              - include = [
                  - "refs/heads/main",
                ] -> null
            }
        }

      - rules {
          - creation                      = false -> null
          - deletion                      = false -> null
          - non_fast_forward              = false -> null
          - required_linear_history       = false -> null
          - required_signatures           = false -> null
          - update                        = false -> null
          - update_allows_fetch_and_merge = false -> null

          - required_status_checks {
              - strict_required_status_checks_policy = true -> null

              - required_check {
                  - context        = "Done" -> null
                  - integration_id = 0 -> null
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"fcc3a6d24f63c6890be952e86d4dd9627dfc254141f78be34b972fe8d044a46d\"" -> "W/\"0dcfd99eadb7671f7766c4f07e4f2104d4bfa9d4b742e669074a0116d608a085\""
        id          = "1393925"
        name        = "protect-main-branch-kong-openssl-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] has been deleted
  - resource "github_repository_ruleset" "pr_ruleset_kong" {
      - enforcement = "active" -> null
      - etag        = "W/\"f7fcdb7dec5ab1e5dc4476aaa77616bd03de8e39ed1c457cc78d444df095a7fd\"" -> null
      - id          = "1393871" -> null
      - name        = "protect-main-branch-kong-package-release" -> null
      - node_id     = "RRS_lACqUmVwb3NpdG9yec4yKpjbzgAVRM8" -> null
      - repository  = "kong-package" -> null
      - ruleset_id  = 1393871 -> null
      - target      = "branch" -> null

      - bypass_actors {
          - actor_id    = 952934 -> null
          - actor_type  = "Integration" -> null
          - bypass_mode = "always" -> null
        }

      - conditions {
          - ref_name {
              - exclude = [] -> null
              - include = [
                  - "refs/heads/main",
                ] -> null
            }
        }

      - rules {
          - creation                      = false -> null
          - deletion                      = false -> null
          - non_fast_forward              = false -> null
          - required_linear_history       = false -> null
          - required_signatures           = false -> null
          - update                        = false -> null
          - update_allows_fetch_and_merge = false -> null

          - required_status_checks {
              - strict_required_status_checks_policy = true -> null

              - required_check {
                  - context        = "Done" -> null
                  - integration_id = 0 -> null
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"ceead2f8a2373a85f1cf611538c4ee51a83ca66204f2807d110e04f3d97f195a\"" -> "W/\"6fa47ba1c73c237182945b7ee3e97ea29d90bd967c91a4c9d7242690071fd2d1\""
        id          = "1393916"
        name        = "protect-main-branch-kong-runtime-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] has been deleted
  - resource "github_repository_ruleset" "pr_ruleset_kong" {
      - enforcement = "active" -> null
      - etag        = "W/\"74c93efaefe5a4ce63a6d80ab9ae99dc789c2a5e507bdd13524a87466a5fd5e5\"" -> null
      - id          = "1422167" -> null
      - name        = "protect-main-branch-multi-arch-fpm-release" -> null
      - node_id     = "RRS_lACqUmVwb3NpdG9yec4yKjYTzgAVs1c" -> null
      - repository  = "multi-arch-fpm" -> null
      - ruleset_id  = 1422167 -> null
      - target      = "branch" -> null

      - bypass_actors {
          - actor_id    = 952934 -> null
          - actor_type  = "Integration" -> null
          - bypass_mode = "always" -> null
        }

      - conditions {
          - ref_name {
              - exclude = [] -> null
              - include = [
                  - "refs/heads/main",
                ] -> null
            }
        }

      - rules {
          - creation                      = false -> null
          - deletion                      = false -> null
          - non_fast_forward              = false -> null
          - required_linear_history       = false -> null
          - required_signatures           = false -> null
          - update                        = false -> null
          - update_allows_fetch_and_merge = false -> null

          - required_status_checks {
              - strict_required_status_checks_policy = true -> null

              - required_check {
                  - context        = "Done" -> null
                  - integration_id = 0 -> null
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"c7ad643238158f1285a1cca9797537dc3d5a25567ac5e983ff22f85734db293e\"" -> "W/\"5f297871bb2c98da4f05a3657d84d55babf8f2f219dbdcb999d136fc91e80348\""
        id          = "1393933"
        name        = "protect-main-branch-template-1-terraform-terraform-plan"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.settings_all["atc-router"] will be created
  + resource "github_repository" "settings_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "atc-router"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "gh-org-template"
          + repository           = "template-1-github-release"
        }
    }

  # github_repository.settings_all["kong-development"] will be created
  + resource "github_repository" "settings_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "kong-development"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "gh-org-template"
          + repository           = "template-1-github-release"
        }
    }

  # github_repository.settings_all["kong-openssl"] will be created
  + resource "github_repository" "settings_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "kong-openssl"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "gh-org-template"
          + repository           = "template-1-github-release"
        }
    }

  # github_repository.settings_all["kong-package"] will be created
  + resource "github_repository" "settings_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "kong-package"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "gh-org-template"
          + repository           = "template-1-github-release"
        }
    }

  # github_repository.settings_all["kong-runtime"] will be created
  + resource "github_repository" "settings_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "kong-runtime"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "gh-org-template"
          + repository           = "template-1-github-release"
        }
    }

  # github_repository.settings_all["multi-arch-fpm"] will be created
  + resource "github_repository" "settings_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "multi-arch-fpm"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "gh-org-template"
          + repository           = "template-1-github-release"
        }
    }

  # github_repository.settings_all["template-template"] will be created
  + resource "github_repository" "settings_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "template-template"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_all" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch-terraform-github-pre-commit"
      + node_id     = (known after apply)
      + repository  = "terraform-github"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_kong" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch-multi-arch-fpm-release"
      + node_id     = (known after apply)
      + repository  = "multi-arch-fpm"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "Done"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_terraform" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch-terraform-github-terraform-plan"
      + node_id     = (known after apply)
      + repository  = "terraform-github"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "terraform"
                  + integration_id = 0
                }
            }
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->